import type { InterViewType } from './InterViewType';

export const OtaYujiConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '転職のきっかけとアイフルへの入社理由',
    text: '今の自分がどこまで通用するのか腕試しをして、キャリアアップにつながる新しい挑戦がしたかったんです。前職は取引先企業のインフラ構築や保守・運用がメインの会社だったため、私が構築したインフラがどんなサービスを下支えしているのか、事業のグロースに伴ってどこが改善点となるかなど、プロダクトやサービスの未来にダイレクトに関われない部分が多くありました。元々エンジニアではなく人材業界で法人営業をしていた身としては、ビジネスやそれを取り巻く人たちの「成長」や「可能性」を肌で感じながら仕事をしたかったんだと思います。そうした経験からAWS エンジニアとしての経験を活かし、組織に貢献しながら自分自身のキャリアアップを両立できるようなポジションを探していたところ、アイフルに出会いました。面談では「これからデジタル内製化に取り組み始めるまさに 0→1 のフェーズ」「AWS に関する知見がなく、専任エンジニアを切実に求めている」といった話を聞いて、ワクワクが止まりませんでしたね。自由な意見や新しい挑戦を奨励する気概を感じられたことも、入社の決め手でした。',
    src: '../assets/Ota_Yuji01.png',
    alt: 'OtaImageMotivation',
  },
  {
    number: '02',
    subTitle: '現在の仕事内容',
    text: (
      <>
        私の所属する課内ではチーフエンジニアとして、プロジェクトのアーキテクチャ検討や技術選定をはじめ、AWS
        アカウントのセキュリティレベル向上、開発メンバーの技術的なサポート (特に AWS インフラ周り)、AWS
        インフラチームの指導・育成などを中心に業務しています。個人では、IaC (インフラのコード化) や CI/CD
        パイプラインの構築など SRE や DevOps の領域を担うことが多いですね。組織横断的な役割だと CCoE チーム (AWS
        推進委員会: 通称 AIAWS) の軸となって、全社的な AWS
        アカウント管理やセキュリティに関する取り決めを推進したり、他部署やグループ会社からの技術的な相談に乗ったりしていますね。
        <br />
        技術面以外では、開発者体験を改善する取り組みや本サイトにも掲載されているチームコアバリューの策定や伝播など、マネジメント領域にも幅広く携わっています。チームで決めた難しいチャレンジをクリアしたり、経験のない領域で採用したアーキテクチャがカチッとハマったときは快感ですね。
      </>
    ),
    src: '../assets/Ota_Yuji02.png',
    alt: 'OtaImagePosition',
  },
  {
    number: '03',
    subTitle: 'アイフルエンジニアチームの魅力',
    text: '一人ひとりの改善意識が高く、好奇心旺盛な方々が多い印象を受けます。普段は穏やかで優しい人たちばかりなので、お互いを人として尊重しながらも、プロジェクトや開発の話になると厳しい意見も率直に伝えてくれる。新しい技術や良い取り組みをどんどん取り入れたい、試したいといったマインドを持っている。自分たちが得た学びや気付きを都度共有したり、分からない部分は繰り返し教え合ったりしている。私の所属する部署では、既存のやり方が確立されていない部分が多いので、未知を楽しめる気概を持った人が自然と集まっている気がします。チームコアバリューを軸に、みんなが自分自身やチーム、そしてお客様やプロダクトに対して真摯に向き合ってくれている結果の表れではないかと考えています。',
    src: '../assets/Ota_Yuji03.png',
    alt: 'AttractionOfAifulGroup',
  },
  {
    number: '04',
    subTitle: 'アイフルで実現したいこと',
    text: '私がチームコアバリューを創った理由でもある「恐れのない組織づくり」にこだわっていきます。その結果として、アイフルが「日本を代表する FinTech カンパニー」に育ってくれたらいいなと思っています。入社当時と比べて、ルールやナレッジ、ドキュメントなどの土台は徐々に整備されつつありますが、働き方、コミュニケーションのあり方、プロジェクトや開発の進め方、どれを取ってもまだまだ改善できる部分は多い。上下関係や年齢、国籍、性別、スキルの差など、そうした壁を取っ払って自由闊達に意見交換ができて、果敢にチャレンジができる。誰が言ったかではなく、何を大切にしたいかを議論できる、そんな組織をつくっていきます。あと、個人の目標としては「目指せ CTO」ですかね (笑) 。全社共通で AWS のことならまずはとにかく「大田」に、と思ってもらえるように第一想起の範囲をさらに拡げていきたいなと。とにかく楽しんで、面白がって、影響度や市場価値の高い仕事をどんどん生み出していきたいです。',
    src: '../assets/Ota_Yuji04.png',
    alt: 'OtaImageGoal',
  },
];
