import type { InterViewType } from './InterViewType';

export const OtaYujiConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Ota_Yuji01.png',
    alt: 'OtaImage01',
  },
  {
    number: '02',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Ota_Yuji02.png',
    alt: 'OtaImage02',
  },
  {
    number: '03',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Ota_Yuji03.png',
    alt: 'OtaImage02',
  },
];
