import type { InterViewType } from './InterViewType';

export const OuKinhouConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Ou_Kinhou01.png',
    alt: 'OuKinhou01',
  },
  {
    number: '02',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Ou_Kinhou02.png',
    alt: 'OuKinhou02',
  },
  {
    number: '03',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Ou_Kinhou03.png',
    alt: 'OuKinhou03',
  },
];
