import type { InterViewType } from './InterViewType';

export const OuKinhouConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '転職のきっかけとアイフルへの入社理由',
    text: (
      <>
        前職では日本で Java
        エンジニアとして開発に携わっていたのですが、当時はコロナ禍でテレワークが中心だったこともあり、コミュニケーションが十分に取れず、もどかしい思いをした経験がありました。また、開発だけにとどまらず、上流工程にも関わりたいという気持ちもあったので、転職を決意しました。
        <br />
        アイフルとの出会いは「CM
        で見たことがある」程度でしたが、面談の中で雑談を交えながら話していくうちに、人柄や職場の雰囲気の良さを感じ取れたことが、入社の大きな決め手になりました。
      </>
    ),
    src: '../assets/Ou_Kinhou01.png',
    alt: 'OuKinhouImpetus',
  },
  {
    number: '02',
    subTitle: '現在の仕事内容',
    text: (
      <>
        Java エンジニアとしてアイフル公式サイトの保守運用に携わっています。中長期の目標としては約 4
        年後に自社だけで保守運用を担える体制を目指して、ベンダーの方々から要件定義やシステム仕様の引き継ぎなど、さまざまな取り組みや会議を重ねている真っ最中です。
        <br />
        チームメンバーとあれやこれやと試行錯誤したり、他愛のないコミュニケーションが取れるのがとても楽しいですね。誰かが話しているのを聞いているだけでも楽しいと思えるぐらい雰囲気が良いし、「どう思いますか？」と自分の意見が自然に求められることが新鮮です。チームでより良いものを作ろうとする意識を端々に感じられる環境が、刺激的でとても素敵だと日々実感しています。
      </>
    ),
    src: '../assets/Ou_Kinhou02.png',
    alt: 'OuKinhouJob',
  },
  {
    number: '03',
    subTitle: 'アイフルエンジニアチームの魅力',
    text: (
      <>
        コミュニケーションを大事にしている人が多い印象ですね。嘘みたいに聞こえるかも知れないですけど、みんな本当に人柄がいい。面白くて、頼りがいもあるし、ポジティブな雰囲気がそれぞれにあって、気軽に質問や相談がしやすい。変にギスギスしていなくて、何かトラブルがあったときには、怒るよりも先に心配するような人たちばかりだと思います。
        <br />
        私自身もそんな風にチームの雰囲気や士気をあげられるようなコミュニケーションを取りたいと考えていますし、チームのみんなに頼られる存在でありたいです。
      </>
    ),
    src: '../assets/Ou_Kinhou03.png',
    alt: 'OuKinhouAttraction',
  },
  {
    number: '04',
    subTitle: 'アイフルで実現したいこと',
    text: 'アイフル公式サイトを「たくさんの人から好かれるユーザーフレンドリーなサービス」に成長させていきたいです。そのためにはサイト全体や一つひとつのパーツの UI に至るまでこだわり抜いて、お客様の UX (ユーザー体験) を向上させていく必要があると思いますし、そうした改善のサイクルをより細かく速く回していくためには、プログラムやインフラのパフォーマンス改善やいかに保守運用を効率化するか、といった観点も重要になってくるでしょう。これらを実現するためには、必要に応じてモダンな技術を取り入れていく姿勢が必要だと考えているので、既存のやり方にとらわれず、柔軟な発想を大切にしていきたいですね。',
    src: '../assets/Ou_Kinhou04.png',
    alt: 'OuKinhouRealization',
  },
];
