import type { InterViewType } from './InterViewType';

export const ShimizuShoConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Shimizu_Sho01.png',
    alt: 'ShimizuShoImpetus',
  },
  {
    number: '02',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Shimizu_Sho02.png',
    alt: 'ShimizuShoJob',
  },
  {
    number: '03',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Shimizu_Sho03.png',
    alt: 'ShimizuShoAttraction',
  },
  {
    number: '04',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Shimizu_Sho04.png',
    alt: 'ShimizuShoRealization',
  },
];
