import type { InterViewType } from './InterViewType';

export const ShimizuShoConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '転職のきっかけとアイフルへの入社理由',
    text: (
      <>
        きっかけは「自分の仕事がユーザーにどんな影響を与えているかを知りたかった」という部分に尽きます。だったら Web
        業界かなと。一方で、当時から「金融」というビジネスドメインに強い関心があったので「金融 × Web
        サービス」の軸で会社を探していたところ、アイフルに出会いました。
        <br />
        入社の決め手は、プロダクトの品質向上や新しいチャレンジを大切にしている雰囲気を感じたからですね。特に AWS
        に挑戦してみたかった。家庭のことを考えて、リモートワークやフレックス勤務など柔軟な働き方が出来る環境を選んでおきたかったのもあります。
      </>
    ),
    src: '../../assets/Shimizu_Sho01.png',
    alt: 'ShimizuShoMotivation',
  },
  {
    number: '02',
    subTitle: '現在の仕事内容',
    text: '入社後すぐはバックエンドを担当していましたが、現在は AWS インフラチームで Web システムの構築や SRE 業務に携わっています。プロジェクトによっては、要件定義や設計のフォローに入ったりすることもありますよ。自分から手を挙げれば、柔軟にチャレンジできる環境が整っていると思います。そうやって自分の手掛けたシステムをお客様が使っている場面に直接立ち会えるのは、やはり嬉しいですね。唯一のギャップといえば、平均年齢の若いチームが多く、初めは馴染めるか少し心配だったぐらいで、技術面でのギャップは今のところ感じません。',
    src: '../../assets/Shimizu_Sho02.png',
    alt: 'ShimizuShoPosition',
  },
  {
    number: '03',
    subTitle: 'アイフルエンジニアチームの魅力',
    text: 'お客様志向の強いチームだと感じています。メンバーそれぞれが技術を手段としてフラットに捉えていて、お客様を第一に考えて、よりよいプロダクトを作ろうとしている。主体的に活動している人が本当に多いです。チームで意見を柔軟に取り入れたり、仕事の進め方そのものや新しい技術、ツールを提案したり。ナレッジを都度共有したり、ドキュメントを整備したり。今さえ良ければ OK という考え方ではなく、先にある未来を着実によくしていこうとしている。私の過去の経験では、リリースを優先するあまり、テストやナレッジ共有、エンジニア間のコミュニケーションが疎かにされがちだったことがあるので、細部まで品質を妥協しない文化が根付いているのは、とても魅力的だと言えますね。',
    src: '../../assets/Shimizu_Sho03.png',
    alt: 'AttractionOfAifulGroup',
  },
  {
    number: '04',
    subTitle: 'アイフルで実現したいこと',
    text: (
      <>
        色んな角度からお客様に価値を届けられるようになりたいですね。新しい技術に触れたり、新しい知見を得られることに特に面白さを感じるので、インフラだけにこだわらずに、バックエンドやフロントエンドにもどんどん挑戦しながら、自分なりの武器を見つけていこうと考えています。
        <br />
        チーム観点では、人によってレベルの異なるスキルを平準化して、プロダクトの品質水準を高めようと取り組んでいる最中です。そのためには、ドキュメント整備やナレッジ共有が必要不可欠だと捉えているので、私から率先垂範していきます。
      </>
    ),
    src: '../../assets/Shimizu_Sho04.png',
    alt: 'ShimizuShoGoal',
  },
];
