import type { InterViewType } from './InterViewType';

export const TominagaRyoConstants: InterViewType[] = [
  {
    number: '01',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Tominaga_Ryo01.png',
    alt: 'TominagaRyo01',
  },
  {
    number: '02',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Tominaga_Ryo02.png',
    alt: 'TominagaRyo02',
  },
  {
    number: '03',
    subTitle: '「金融からITへ」ビジネスとしての可能性を感じて入社を決意。',
    text: '仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。 仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります。仕事内容詳細テキストが入ります',
    src: '../assets/Tominaga_Ryo03.png',
    alt: 'TominagaRyo03',
  },
];
